      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORMTHRUINIFIM2.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
          PERFORM INICIO THRU FIM.
            STOP RUN.

       INICIO.
           DISPLAY "INICIO".
       PASSO-1.
           DISPLAY "PASSO 1".
       PASSO-2.
           DISPLAY "PASSO 2".
       FIM.
           DISPLAY "FIM".

       END PROGRAM PERFORMTHRUINIFIM2.
