      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORMTHRUINIFIM2.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
          PERFORM ETAPA1 THRU ETAPA3.
            STOP RUN.

       ETAPA1.
           DISPLAY "ETAPA 1".
       ETAPA2.
           DISPLAY "ETAPA 2".
       ETAPA3.
           DISPLAY "ETAPA 3".



       END PROGRAM PERFORMTHRUINIFIM2.
