      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORMSIMP01.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            PERFORM MOSTRAR-MENSAGEM.
            STOP RUN.

       MOSTRAR-MENSAGEM.
            DISPLAY "Ola Mundo.".
       END PROGRAM PERFORMSIMP01.
